app/views/teams/index.html.erb

SELECT "teams".* FROM "teams" ORDER BY created_at DESC
---
                <td class="team-row"><%= team.name %></td>
                <td class="team-row"><%= team.value + team.balance %></td>