app/controllers/teams_controller.rb

SELECT "teams".* FROM "teams" ORDER BY created_at DESC
---
  def index
    @teams = Team.all.order("created_at DESC")

INSERT INTO "teams" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Team1"], ["created_at", "2019-11-01 18:20:48.380860"], ["updated_at", "2019-11-01 18:20:48.380860"]]
---
  def create
    @team = Team.new(team_params)

    respond_to do |format|
      if @team.save

UPDATE "teams" SET "name" = ?, "value" = ?, "updated_at" = ? WHERE "teams"."id" = ?  [["name", "Team1"], ["value", 666], ["updated_at", "2019-11-01 16:15:27.608994"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @team.update(team_params)

SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_team
      @team = Team.find(params[:id]) #This doesn't make sense. Why are we searching for a team that matches the User id?