app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("email", "firstname", "lastname", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["email", "hanyao.liu98@gmail.com"], ["firstname", "Hanyao"], ["lastname", "Liu"], ["created_at", "2019-10-24 21:26:48.423435"], ["updated_at", "2019-10-24 21:26:48.423435"]]